artillery.yml
config:
    target: "http://localhost:3001"
    processor: "./testGenerator.js"
    phases:

      - duration: 10
        arrivalRate: 1
        maxVusers: 1
        name: "1 user"

      - pause: 30

      - duration: 60
        arrivalRate: 10
        maxVusers: 10
        name: "10 users"

      - pause: 30

      - duration: 60
        arrivalRate: 100
        maxVusers: 100
        name: "100 users"

      - pause: 30

      - duration: 60
        arrivalRate: 1000
        maxVusers: 1000
        name: "1000 users"

scenarios:
  - name: "GET route test"
    weight: 90
    flow:
    - function: "rng"
    - get:
        url: "/games/{{id}}"

  - name: "POST route test"
    weight: 10
    flow:
    - function: "rng"
    - post:
        url: "/addGame/{{id}}"